InformationRegisters/РегламентныеИнтервалыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РегламентныеИнтервалыДокументов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияРегламентныхИнтервалов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Срок</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаВыполнения</Name>
					<Comment>Дата и время фактического выполнения регламентного интервала</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКонечногоЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтклонениеОтПлана</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторПоследнегоИзменения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПоследнегоИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентныйИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭтапыРегламентногоИнтервалаДокумента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭтапыРегламентногоИнтервалаДокумента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СрокПоРегламенту</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокНапоминания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокВыполненияЧасы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Предмет</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПредметПроцессаОбработкиДокументов</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РегламентныйИнтервал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РегламентныеИнтервалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерИтерации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторЭтапа</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СостоянияРегламентныхИнтервалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СостоянияРегламентныхИнтервалов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Активен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прерван</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/РегламентныеИнтервалыДокументов/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ПодготовкаФормыПриЧтенииНаСервере();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
	ПроцессыОбработкиДокументовПереопределяемый.ПриСозданииНаСервереФормыРегламентногоИнтервалаДокумента(ЭтотОбъект);
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Модифицированность Тогда
		ТекущийОбъект.АвторПоследнегоИзменения = Пользователи.АвторизованныйПользователь();
		ТекущийОбъект.ДатаПоследнегоИзменения = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Набор = РегистрыСведений.ЭтапыРегламентногоИнтервалаДокумента.СоздатьНаборЗаписей();
	Набор.Отбор.Предмет.Установить(ТекущийОбъект.Предмет);
	Набор.Отбор.РегламентныйИнтервал.Установить(ТекущийОбъект.РегламентныйИнтервал);
	Набор.Отбор.НомерИтерации.Установить(ТекущийОбъект.НомерИтерации);
	Для Каждого Этап Из ЭтапыРегламентногоИнтервала Цикл
		ЗаписьНабора = Набор.Добавить();
		ЗаписьНабора.Предмет = ТекущийОбъект.Предмет;
		ЗаписьНабора.РегламентныйИнтервал = ТекущийОбъект.РегламентныйИнтервал;
		ЗаписьНабора.НомерИтерации = ТекущийОбъект.НомерИтерации;
		ЗаписьНабора.ИдентификаторЭтапа = Этап.ИдентификаторЭтапа;
		ЗаписьНабора.СрокПоРегламенту = Этап.СрокПоРегламенту;
		ЗаписьНабора.СрокНапоминания = Этап.СрокНапоминания;
		ЗаписьНабора.СрокВыполненияЧасы = Этап.СрокВыполненияЧасы;
	КонецЦикла;
	Набор.Записать(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаполнитьПредставлениеПоследнегоИзменения();
	
	УстановитьВидимостьЭлементовФормы();
	
	// СтандартныеПодсистемы.УправлениеДоступом
	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.УправлениеДоступом") Тогда
		МодульУправлениеДоступом = ОбщегоНазначения.ОбщийМодуль("УправлениеДоступом");
		МодульУправлениеДоступом.ПослеЗаписиНаСервере(ЭтотОбъект, ТекущийОбъект, ПараметрыЗаписи);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.УправлениеДоступом
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СрокПриИзменении(Элемент)
	
	ВыполнитьПересчетСроковЭтапов();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПодготовкаФормыПриЧтенииНаСервере()
	
	Заголовок = НСтр("ru = 'Регламентный интервал документа'") + " (" + Строка(Запись.Состояние) + ")";
	
	ТолькоПросмотр = Запись.Состояние <> ПредопределенноеЗначение("Перечисление.СостоянияРегламентныхИнтервалов.Активен");
	
	ЗаполнитьПредставлениеПоследнегоИзменения();
	
	ЗначениеВРеквизитФормы(
		ТаблицаЭтаповРегламентногоИнтервалаДокумента(Запись.РегламентныйИнтервал, Запись.НомерИтерации, Запись.Предмет),
		"ЭтапыРегламентногоИнтервала");
	
	ОбновитьДеревоЭтаповПоДаннымОбъекта();
	
	УстановитьВидимостьЭлементовФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТаблицаЭтаповРегламентногоИнтервалаДокумента(РегламентныйИнтервал, НомерИтерации, Документ)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЭтапыРегламентногоИнтервалаДокумента.ИдентификаторЭтапа КАК ИдентификаторЭтапа,
	|	ЭтапыРегламентногоИнтервалаДокумента.СрокВыполненияЧасы КАК СрокВыполненияЧасы,
	|	ЭтапыРегламентногоИнтервалаДокумента.СрокПоРегламенту КАК СрокПоРегламенту,
	|	ЭтапыРегламентногоИнтервалаДокумента.СрокНапоминания КАК СрокНапоминания,
	|	ШаблоныПроцессовЭтапы.НомерСтроки КАК НомерСтроки,
	|	ШаблоныПроцессовЭтапы.Этап КАК Этап,
	|	ШаблоныПроцессовЭтапы.Исполнитель КАК Исполнитель,
	|	ШаблоныПроцессовЭтапы.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	|	ШаблоныПроцессовЭтапы.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации,
	|	ШаблоныПроцессовЭтапы.ИмяРеквизитаОсновногоОбъектаАдресации КАК ИмяРеквизитаОсновногоОбъектаАдресации,
	|	ШаблоныПроцессовЭтапы.ИмяРеквизитаДополнительногоОбъектаАдресации КАК ИмяРеквизитаДополнительногоОбъектаАдресации,
	|	ВЫРАЗИТЬ("""" КАК СТРОКА(100)) КАК ПредставлениеЭтапа,
	|	ЕСТЬNULL(НЕ ЗадачаПоОбработкеДокумента.Выполнена, ЛОЖЬ) КАК Выполняется
	|ИЗ
	|	РегистрСведений.ЭтапыРегламентногоИнтервалаДокумента КАК ЭтапыРегламентногоИнтервалаДокумента
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|		ПО ЭтапыРегламентногоИнтервалаДокумента.РегламентныйИнтервал.Владелец = ШаблоныПроцессовЭтапы.Ссылка
	|			И ЭтапыРегламентногоИнтервалаДокумента.ИдентификаторЭтапа = ШаблоныПроцессовЭтапы.ИдентификаторЭтапа
	|		ЛЕВОЕ СОЕДИНЕНИЕ Задача.ЗадачаПоОбработкеДокумента КАК ЗадачаПоОбработкеДокумента
	|		ПО ЭтапыРегламентногоИнтервалаДокумента.Предмет = ЗадачаПоОбработкеДокумента.Предмет
	|			И ЭтапыРегламентногоИнтервалаДокумента.РегламентныйИнтервал = ЗадачаПоОбработкеДокумента.РегламентныйИнтервал
	|			И ЭтапыРегламентногоИнтервалаДокумента.НомерИтерации = ЗадачаПоОбработкеДокумента.НомерИтерации
	|			И ЭтапыРегламентногоИнтервалаДокумента.ИдентификаторЭтапа = ЗадачаПоОбработкеДокумента.ИдентификаторЭтапа
	|			И (НЕ ЗадачаПоОбработкеДокумента.Выполнена)
	|			И (НЕ ЗадачаПоОбработкеДокумента.ПометкаУдаления)
	|ГДЕ
	|	ЭтапыРегламентногоИнтервалаДокумента.РегламентныйИнтервал = &РегламентныйИнтервал
	|	И ЭтапыРегламентногоИнтервалаДокумента.НомерИтерации = &НомерИтерации
	|	И ЭтапыРегламентногоИнтервалаДокумента.Предмет = &Предмет";
	
	Запрос.УстановитьПараметр("РегламентныйИнтервал", РегламентныйИнтервал);
	Запрос.УстановитьПараметр("НомерИтерации", НомерИтерации);
	Запрос.УстановитьПараметр("Предмет", Документ);
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Запрос.Выполнить().Выгрузить();
	УстановитьПривилегированныйРежим(Ложь);
	
	Для Каждого СтрокаРезультата Из Результат Цикл
		
		ИсполнительЭтапаСтрокой = ПроцессыОбработкиДокументовКлиентСервер.ПредставлениеИсполнителяЭтапа(
			СтрокаРезультата.Исполнитель,
			СтрокаРезультата.ОсновнойОбъектАдресации,
			СтрокаРезультата.ДополнительныйОбъектАдресации,
			СтрокаРезультата.ИмяРеквизитаОсновногоОбъектаАдресации,
			СтрокаРезультата.ИмяРеквизитаДополнительногоОбъектаАдресации);
		
		СтрокаРезультата.ПредставлениеЭтапа = Строка(СтрокаРезультата.НомерСтроки)+". "+СтрокаРезультата.Этап
			+ " (" + ИсполнительЭтапаСтрокой + ")";
			
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Процедура ОбновитьДеревоЭтаповПоДаннымОбъекта()
	
	ДеревоЭтапов.ПолучитьЭлементы().Очистить();
	
	СвойстваРИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Запись.РегламентныйИнтервал, "ПредшественникиЭтапов, ИдентификаторНачальногоЭтапа, ИдентификаторКонечногоЭтапа");
	СвойстваРИ.ПредшественникиЭтапов = СвойстваРИ.ПредшественникиЭтапов.Выгрузить();
	
	Маршруты = ПроцессыОбработкиДокументов.МаршрутыШаблонаОтНачальногоЭтапаДоКонечного(
		СвойстваРИ.ПредшественникиЭтапов, СвойстваРИ.ИдентификаторНачальногоЭтапа, СвойстваРИ.ИдентификаторКонечногоЭтапа);
		
	Если Маршруты.Количество() = 0 Тогда
		ОбщегоНазначения.СообщитьПользователю(НСтр("ru = 'Не удалось проложить маршрут от начального этапа до конечного.'"));
		Возврат;
	КонецЕсли;
	
	//Заполнение дерева этапов с учетом параллельных
	ПроцессыОбработкиДокументов.ЗаполнитьДеревоЭтапов(ДеревоЭтапов, ЭтапыРегламентногоИнтервала, Маршруты);
	
	РассчитатьСрокиВГруппахЭтаповДерева();
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСрокиВГруппахЭтаповДерева()
	
	Для Каждого ЭлементДерева Из ДеревоЭтапов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ИдентификаторЭтапа = "Параллельно" Тогда
			РассчитатьСрокПараллельнойГруппыЭтапов(ЭлементДерева);
		ИначеЕсли ЭлементДерева.ИдентификаторЭтапа = "Последовательно" Тогда
			РассчитатьСрокПоследовательнойГруппыЭтапов(ЭлементДерева);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСрокПараллельнойГруппыЭтапов(ГруппаЭтапов)
	
	Срок = 0;
	
	Для Каждого ЭлементДерева Из ГруппаЭтапов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ИдентификаторЭтапа = "Параллельно" Тогда
			РассчитатьСрокПараллельнойГруппыЭтапов(ЭлементДерева);
		ИначеЕсли ЭлементДерева.ИдентификаторЭтапа = "Последовательно" Тогда
			РассчитатьСрокПоследовательнойГруппыЭтапов(ЭлементДерева);
		КонецЕсли;
		Срок = Макс(Срок, ЭлементДерева.СрокВыполненияЧасы);
	КонецЦикла;
	
	ГруппаЭтапов.СрокВыполненияЧасы = Срок;
	
КонецПроцедуры

&НаСервере
Процедура РассчитатьСрокПоследовательнойГруппыЭтапов(ГруппаЭтапов)
	
	Срок = 0;
	
	Для Каждого ЭлементДерева Из ГруппаЭтапов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ИдентификаторЭтапа = "Параллельно" Тогда
			РассчитатьСрокПараллельнойГруппыЭтапов(ЭлементДерева);
		ИначеЕсли ЭлементДерева.ИдентификаторЭтапа = "Последовательно" Тогда
			РассчитатьСрокПоследовательнойГруппыЭтапов(ЭлементДерева);
		КонецЕсли;
		Срок = Срок + ЭлементДерева.СрокВыполненияЧасы;
	КонецЦикла;
	
	ГруппаЭтапов.СрокВыполненияЧасы = Срок;
	
КонецПроцедуры

&НаСервере
Процедура ВыполнитьПересчетСроковЭтапов()
	
	СрокВыполенияИнтервала = Запись.Срок;
	
	СвойстваРИ = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		Запись.РегламентныйИнтервал, "Владелец, ПредшественникиЭтапов, Этапы, ИдентификаторНачальногоЭтапа, ИдентификаторКонечногоЭтапа");
		
	СвойстваРИ.ПредшественникиЭтапов = СвойстваРИ.ПредшественникиЭтапов.Выгрузить();
	
	// Реквизиты адресации заполним по начальному этапу регламентного интервала
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА ШаблоныПроцессовЭтапы.Исполнитель ССЫЛКА Справочник.Пользователи
	|			ТОГДА ШаблоныПроцессовЭтапы.Исполнитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
	|	КОНЕЦ КАК Исполнитель,
	|	ВЫБОР
	|		КОГДА ШаблоныПроцессовЭтапы.Исполнитель ССЫЛКА Справочник.РолиИсполнителей
	|			ТОГДА ШаблоныПроцессовЭтапы.Исполнитель
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.РолиИсполнителей.ПустаяСсылка)
	|	КОНЕЦ КАК РольИсполнителя,
	|	ШаблоныПроцессовЭтапы.ОсновнойОбъектАдресации КАК ОсновнойОбъектАдресации,
	|	ШаблоныПроцессовЭтапы.ДополнительныйОбъектАдресации КАК ДополнительныйОбъектАдресации
	|ИЗ
	|	Справочник.ШаблоныПроцессов.Этапы КАК ШаблоныПроцессовЭтапы
	|ГДЕ
	|	ШаблоныПроцессовЭтапы.ИдентификаторЭтапа = &ИдентификаторЭтапа
	|	И ШаблоныПроцессовЭтапы.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", СвойстваРИ.Владелец);
	Запрос.УстановитьПараметр("ИдентификаторЭтапа", СвойстваРИ.ИдентификаторНачальногоЭтапа);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	РеквизитыАдресации = Новый Структура("Исполнитель, РольИсполнителя, ОсновнойОбъектАдресации, ДополнительныйОбъектАдресации");
	ЗаполнитьЗначенияСвойств(РеквизитыАдресации, Выборка);
	
	ИнтервалыРабочегоВремени = ПроцессыОбработкиДокументов.ПустаяТаблицаРабочегоВремени();
	СтандартнаяОбработка = Истина;
	ГрафикРаботы = Неопределено;
	
	Если Константы.ИспользоватьГрафикиРаботы.Получить() Тогда
		ГрафикРаботы = ПроцессыОбработкиДокументов.ГрафикРаботыИсполнителя(РеквизитыАдресации, СтандартнаяОбработка);
	КонецЕсли;
	
	Результат = СвойстваРИ.Этапы.Выгрузить();
	ИдентификаторыИСрокиЭтапов = Результат.Скопировать(, "ИдентификаторЭтапа, СрокВыполненияЧасы");
	ИдентификаторыИСрокиЭтапов.Колонки.Добавить("СрокПоРегламенту");
	ИдентификаторыИСрокиЭтапов.Колонки.Добавить("СрокНапоминания");
	ИдентификаторыИСрокиЭтапов.Колонки.Добавить("НачалоЭтапаНеПозднее");
	
	ПроцессыОбработкиДокументов.РасчетРегламентныхСроковЭтапаИЕгоПредшественников(ИдентификаторыИСрокиЭтапов, СвойстваРИ.ИдентификаторКонечногоЭтапа,
		СрокВыполенияИнтервала, ИнтервалыРабочегоВремени, ГрафикРаботы, СтандартнаяОбработка, СвойстваРИ.ПредшественникиЭтапов, Новый Соответствие);
	
	Для Каждого ИдентификаторИСрокЭтапа Из ИдентификаторыИСрокиЭтапов Цикл
		Для Каждого Этап Из ЭтапыРегламентногоИнтервала Цикл
			Если ИдентификаторИСрокЭтапа.ИдентификаторЭтапа = Этап.ИдентификаторЭтапа Тогда
				Этап.СрокПоРегламенту = ИдентификаторИСрокЭтапа.СрокПоРегламенту;
				Этап.СрокНапоминания = ИдентификаторИСрокЭтапа.СрокНапоминания;
				Продолжить;
			КонецЕсли;
		КонецЦикла;
		ЗаполнитьСрокЭтапаВДереве(ДеревоЭтапов, ИдентификаторИСрокЭтапа.ИдентификаторЭтапа, ИдентификаторИСрокЭтапа.СрокПоРегламенту);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСрокЭтапаВДереве(ДеревоЭтапов, ИдентификаторЭтапа, СрокПоРегламенту)
	
	Для Каждого ЭлементДерева Из ДеревоЭтапов.ПолучитьЭлементы() Цикл
		Если ЭлементДерева.ИдентификаторЭтапа = ИдентификаторЭтапа Тогда
			ЭлементДерева.СрокПоРегламенту = СрокПоРегламенту;
			Возврат;
		КонецЕсли;
		Если ЭлементДерева.ИдентификаторЭтапа = "Параллельно" ИЛИ ЭлементДерева.ИдентификаторЭтапа = "Последовательно" Тогда
			ЗаполнитьСрокЭтапаВДереве(ЭлементДерева, ИдентификаторЭтапа, СрокПоРегламенту);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеПоследнегоИзменения()
	
	Если ЗначениеЗаполнено(Запись.ДатаПоследнегоИзменения) Тогда
		ПоследнееИзменение = СокрЛП(Строка(Запись.АвторПоследнегоИзменения)) + ", " + Запись.ДатаПоследнегоИзменения;
	Иначе
		ПоследнееИзменение = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьВидимостьЭлементовФормы()
	
	ВидимостьПоследнегоИзменения = ЗначениеЗаполнено(Запись.ДатаПоследнегоИзменения);
	
	ОбщегоНазначенияКлиентСервер.УстановитьСвойствоЭлементаФормы(Элементы, "ПоследнееИзменение", "Видимость", ВидимостьПоследнегоИзменения);
	
КонецПроцедуры

#КонецОбласти
